## Plan Result (Aks_ptl - DeployInfrastructure)




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 1 to change, 2 to destroy.</code></pre>

* Create
  * azurerm_resource_group.kubernetes_resource_group[&#34;01&#34;]
  * module.kubernetes[&#34;01&#34;].azapi_resource.service_operator_credential
  * module.kubernetes[&#34;01&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.aks_auto_shutdown[0]
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.node_infrastructure_update_scale_set
  * module.kubernetes[&#34;01&#34;].azurerm_role_assignment.update_checker[0]
* Update
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster.kubernetes_cluster
* Delete
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;cronjob&#34;]
  * module.kubernetes[&#34;00&#34;].azurerm_kubernetes_cluster_node_pool.additional_node_pools[&#34;linux&#34;]




<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_resource_group.kubernetes_resource_group["01"] will be created
  + resource "azurerm_resource_group" "kubernetes_resource_group" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "ss-ptl-01-rg"
      + tags     = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster.kubernetes_cluster will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      + automatic_upgrade_channel           = "patch"
        id                                  = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-ptl-00-aks"
        name                                = "ss-ptl-00-aks"
        tags                                = {
            "application"  = "core"
            "autoShutdown" = "true"
            "builtFrom"    = "hmcts/aks-sds-deploy"
            "businessArea" = "Cross-Cutting"
            "criticality"  = "High"
            "environment"  = "production"
        }
        # (36 unchanged attributes hidden)

        # (10 unchanged blocks hidden)
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["cronjob"] will be destroyed
  # (because key ["cronjob"] is not in for_each map)
  - resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - auto_scaling_enabled          = true -> null
      - fips_enabled                  = false -> null
      - host_encryption_enabled       = false -> null
      - id                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-ptl-00-aks/agentPools/cronjob" -> null
      - kubelet_disk_type             = "OS" -> null
      - kubernetes_cluster_id         = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-ptl-00-aks" -> null
      - max_count                     = 10 -> null
      - max_pods                      = 30 -> null
      - min_count                     = 0 -> null
      - mode                          = "User" -> null
      - name                          = "cronjob" -> null
      - node_count                    = 1 -> null
      - node_labels                   = {} -> null
      - node_public_ip_enabled        = false -> null
      - node_taints                   = [
          - "dedicated=jobs:NoSchedule",
        ] -> null
      - orchestrator_version          = "1.30" -> null
      - os_disk_size_gb               = 128 -> null
      - os_disk_type                  = "Ephemeral" -> null
      - os_sku                        = "Ubuntu" -> null
      - os_type                       = "Linux" -> null
      - priority                      = "Regular" -> null
      - scale_down_mode               = "Delete" -> null
      - spot_max_price                = -1 -> null
      - tags                          = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/aks-sds-deploy"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "High"
          - "environment"  = "production"
        } -> null
      - ultra_ssd_enabled             = false -> null
      - vm_size                       = "Standard_D4ds_v5" -> null
      - vnet_subnet_id                = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/aks-00" -> null
      - zones                         = [
          - "1",
        ] -> null
        # (6 unchanged attributes hidden)

      - timeouts {
          - update = "180m" -> null
        }

      - upgrade_settings {
          - drain_timeout_in_minutes      = 0 -> null
          - max_surge                     = "33%" -> null
          - node_soak_duration_in_minutes = 0 -> null
        }
    }

  # module.kubernetes["00"].azurerm_kubernetes_cluster_node_pool.additional_node_pools["linux"] will be destroyed
  # (because key ["linux"] is not in for_each map)
  - resource "azurerm_kubernetes_cluster_node_pool" "additional_node_pools" {
      - auto_scaling_enabled          = true -> null
      - fips_enabled                  = false -> null
      - host_encryption_enabled       = false -> null
      - id                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-ptl-00-aks/agentPools/linux" -> null
      - kubelet_disk_type             = "OS" -> null
      - kubernetes_cluster_id         = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-00-rg/providers/Microsoft.ContainerService/managedClusters/ss-ptl-00-aks" -> null
      - max_count                     = 10 -> null
      - max_pods                      = 30 -> null
      - min_count                     = 2 -> null
      - mode                          = "User" -> null
      - name                          = "linux" -> null
      - node_count                    = 2 -> null
      - node_labels                   = {} -> null
      - node_public_ip_enabled        = false -> null
      - node_taints                   = [] -> null
      - orchestrator_version          = "1.30" -> null
      - os_disk_size_gb               = 128 -> null
      - os_disk_type                  = "Ephemeral" -> null
      - os_sku                        = "Ubuntu" -> null
      - os_type                       = "Linux" -> null
      - priority                      = "Regular" -> null
      - scale_down_mode               = "Delete" -> null
      - spot_max_price                = -1 -> null
      - tags                          = {
          - "application"  = "core"
          - "autoShutdown" = "true"
          - "builtFrom"    = "hmcts/aks-sds-deploy"
          - "businessArea" = "Cross-Cutting"
          - "criticality"  = "High"
          - "environment"  = "production"
        } -> null
      - ultra_ssd_enabled             = false -> null
      - vm_size                       = "Standard_D4ds_v5" -> null
      - vnet_subnet_id                = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/aks-00" -> null
      - zones                         = [
          - "1",
        ] -> null
        # (6 unchanged attributes hidden)

      - timeouts {
          - update = "180m" -> null
        }

      - upgrade_settings {
          - drain_timeout_in_minutes      = 0 -> null
          - max_surge                     = "33%" -> null
          - node_soak_duration_in_minutes = 0 -> null
        }
    }

  # module.kubernetes["01"].azapi_resource.service_operator_credential will be created
  + resource "azapi_resource" "service_operator_credential" {
      + body                      = (known after apply)
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + location                  = "uksouth"
      + name                      = "ss-ptl-01-aks"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-ptl-mi"
      + removing_special_chars    = false
      + schema_validation_enabled = false
      + tags                      = (known after apply)
      + type                      = "Microsoft.ManagedIdentity/userAssignedIdentities/federatedIdentityCredentials@2022-01-31-preview"
    }

  # module.kubernetes["01"].azurerm_kubernetes_cluster.kubernetes_cluster will be created
  + resource "azurerm_kubernetes_cluster" "kubernetes_cluster" {
      + automatic_upgrade_channel           = "patch"
      + azure_policy_enabled                = false
      + cost_analysis_enabled               = true
      + current_kubernetes_version          = (known after apply)
      + dns_prefix                          = "k8s-ss-ptl-aks"
      + fqdn                                = (known after apply)
      + http_application_routing_zone_name  = (known after apply)
      + id                                  = (known after apply)
      + image_cleaner_enabled               = false
      + kube_admin_config                   = (sensitive value)
      + kube_admin_config_raw               = (sensitive value)
      + kube_config                         = (sensitive value)
      + kube_config_raw                     = (sensitive value)
      + kubernetes_version                  = "1.30"
      + location                            = "uksouth"
      + name                                = "ss-ptl-01-aks"
      + node_os_upgrade_channel             = "NodeImage"
      + node_resource_group                 = "ss-ptl-01-aks-node-rg"
      + node_resource_group_id              = (known after apply)
      + oidc_issuer_enabled                 = true
      + oidc_issuer_url                     = (known after apply)
      + portal_fqdn                         = (known after apply)
      + private_cluster_enabled             = false
      + private_cluster_public_fqdn_enabled = false
      + private_dns_zone_id                 = (known after apply)
      + private_fqdn                        = (known after apply)
      + resource_group_name                 = "ss-ptl-01-rg"
      + role_based_access_control_enabled   = true
      + run_command_enabled                 = true
      + sku_tier                            = "Standard"
      + support_plan                        = "KubernetesOfficial"
      + tags                                = {
          + "application"  = "core"
          + "autoShutdown" = "true"
          + "builtFrom"    = "hmcts/aks-sds-deploy"
          + "businessArea" = "Cross-Cutting"
          + "criticality"  = "High"
          + "environment"  = "production"
        }
      + workload_identity_enabled           = true

      + auto_scaler_profile (known after apply)

      + azure_active_directory_role_based_access_control {
          + admin_group_object_ids = [
              + "a6ce5b32-e0a5-419e-ba5c-67863c975941",
              + (sensitive value),
            ]
          + azure_rbac_enabled     = false
          + tenant_id              = (known after apply)
        }

      + default_node_pool {
          + auto_scaling_enabled         = true
          + kubelet_disk_type            = (known after apply)
          + max_count                    = 4
          + max_pods                     = 50
          + min_count                    = 2
          + name                         = "system"
          + node_count                   = (known after apply)
          + node_labels                  = (known after apply)
          + only_critical_addons_enabled = true
          + orchestrator_version         = "1.30"
          + os_disk_size_gb              = 128
          + os_disk_type                 = "Ephemeral"
          + os_sku                       = (known after apply)
          + scale_down_mode              = "Delete"
          + tags                         = {
              + "application"  = "core"
              + "autoShutdown" = "true"
              + "builtFrom"    = "hmcts/aks-sds-deploy"
              + "businessArea" = "Cross-Cutting"
              + "criticality"  = "High"
              + "environment"  = "production"
            }
          + type                         = "VirtualMachineScaleSets"
          + ultra_ssd_enabled            = false
          + vm_size                      = "Standard_D4ds_v5"
          + vnet_subnet_id               = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-network-rg/providers/Microsoft.Network/virtualNetworks/ss-ptl-vnet/subnets/aks-01"
          + workload_runtime             = (known after apply)
          + zones                        = [
              + "1",
            ]

          + upgrade_settings {
              + drain_timeout_in_minutes      = 0
              + max_surge                     = "33%"
              + node_soak_duration_in_minutes = 0
            }
        }

      + identity {
          + identity_ids = [
              + "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-ptl-mi",
            ]
          + principal_id = (known after apply)
          + tenant_id    = (known after apply)
          + type         = "UserAssigned"
        }

      + key_vault_secrets_provider {
          + secret_identity          = (known after apply)
          + secret_rotation_enabled  = true
          + secret_rotation_interval = "5m"
        }

      + kubelet_identity {
          + client_id                 = "471db0c1-4f2a-4ae7-957c-b881d4c61c88"
          + object_id                 = "7a6762ce-8a4f-4496-b7e5-08ea2f55bbc4"
          + user_assigned_identity_id = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/genesis-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/aks-kubelet-ptl-mi"
        }

      + linux_profile {
          + admin_username = "k8sadmin"

          + ssh_key {
              + key_data = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAABgQDGk0M1s1gOt2Sy4Yhl7kvzI5Op0yNbjjghn3fVCTJ8tjF/7j98TuQtxxxr6dWb1ovKbdAmy5d9FFUUXxBGGji8ka0OKHF8Rz5/3IqzMucpTzAfNCe9xP6Y1/qnml8atYToLw3qQDWK0O/+VuK1tk8wj0uvc1xUMGoePCLIqi+7d/kBJzd3ojsi2o+JMLLAUAWbMSRCnGalojCiwSNU5zBJdBtQq2w00L77wbFukjFz5dGnk5UMCiEDNKqz4aDaiNYVq87PE1L55HlR5W1OzmTVldvIkNDuLY8Sp8sJ42nZl6BsZfBux/fM93GByokLIwZfhgFlIuVpz0VF/FVritxuUNkVg5o9z6i06vmzq0s4+HcfyTqkHuMM9uD/A9VVnbwYkQv9PV7flPW4SMOXW2EncIGGd/u1Y3CwJ8P3jNWbjy7A+yVR8N6QqWvZ2tPI5lWwUSq4J4gjbRn78MmrbDMZOWpL0hyXGX3QTJtbIteJz+bgb6H6WPL0rxv7ZbeLxmM="
            }
        }

      + maintenance_window_node_os {
          + duration   = 4
          + frequency  = "Daily"
          + interval   = 1
          + start_date = (known after apply)
          + start_time = "16:00"
          + utc_offset = "+00:00"
        }

      + network_profile {
          + dns_service_ip     = (known after apply)
          + ip_versions        = (known after apply)
          + load_balancer_sku  = "standard"
          + network_data_plane = "azure"
          + network_mode       = (known after apply)
          + network_plugin     = "azure"
          + network_policy     = (known after apply)
          + outbound_type      = "loadBalancer"
          + pod_cidr           = (known after apply)
          + pod_cidrs          = (known after apply)
          + service_cidr       = (known after apply)
          + service_cidrs      = (known after apply)

          + load_balancer_profile (known after apply)

          + nat_gateway_profile (known after apply)
        }

      + windows_profile (known after apply)
    }

  # module.kubernetes["01"].azurerm_role_assignment.aks_auto_shutdown[0] will be created
  + resource "azurerm_role_assignment" "aks_auto_shutdown" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "41b2e9c9-db54-40fa-a7c0-a04a5ea7531e"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["01"].azurerm_role_assignment.node_infrastructure_update_scale_set will be created
  + resource "azurerm_role_assignment" "node_infrastructure_update_scale_set" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "7a6762ce-8a4f-4496-b7e5-08ea2f55bbc4"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Virtual Machine Contributor"
      + scope                            = "/subscriptions/6c4d2513-a873-41b4-afdd-b05a33206631/resourceGroups/ss-ptl-01-aks-node-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.kubernetes["01"].azurerm_role_assignment.update_checker[0] will be created
  + resource "azurerm_role_assignment" "update_checker" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "8de130f9-2f85-4339-a351-a747fcd09e2b"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = (known after apply)
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 6 to add, 1 to change, 2 to destroy.

Changes to Outputs:
  ~ clusters = "00" -> "00 01"
```

</details>





<!-- github-comment: {"Command":"plan","PRNumber":658,"Program":"tfcmt","SHA1":"","Target":"Aks_ptl - DeployInfrastructure","Vars":{}} -->